In [1]:
import pandas as pd
from pandas import DataFrame, Series
df = DataFrame()
df['name'] = ['John', 'Steve', 'Sarah']
df['gender'] = ['Male', 'Male', 'Female']
df['age'] = [31, 32, 19]

In [2]:
df

    name  gender  age
0   John    Male   31
1  Steve    Male   32
2  Sarah  Female   19

In [3]:
def mean_age_by_group(dataframe, col):
    # groups the data by a column and returns the mean age per group
    return dataframe.groupby(col).mean()

In [4]:
df.pipe(mean_age_by_group, col='gender')

         age
gender
Female  19.0
Male    31.5

In [5]:
import pandas as pd
import numpy as np

In [6]:
df.pipe(mean_age_by_group, col='name')

       age
name
John    31
Sarah   19
Steve   32

In [7]:
time = pd.date_range('1/1/2000', periods=2000, freq='5min')

In [8]:
series = pd.Series(np.random.randint(100, size=2000), index=time)

In [9]:
series[0:10]

2000-01-01 00:00:00    62
2000-01-01 00:05:00    89
2000-01-01 00:10:00    22
2000-01-01 00:15:00    78
2000-01-01 00:20:00    97
2000-01-01 00:25:00     9
2000-01-01 00:30:00    17
2000-01-01 00:35:00    87
2000-01-01 00:40:00     3
2000-01-01 00:45:00    72
Freq: 5T, dtype: int64

In [10]:
series.groupby(series.index.hour).mean()

0     47.988095
1     51.523810
2     52.392857
3     49.095238
4     53.916667
5     49.035714
6     48.154762
7     46.547619
8     51.904762
9     49.750000
10    51.619048
11    51.523810
12    50.690476
13    49.964286
14    46.452381
15    55.500000
16    52.797619
17    48.357143
18    45.023810
19    49.297619
20    49.238095
21    50.297619
22    48.475000
23    51.666667
dtype: float64

In [11]:
commander_names = ["Alan Brooke", "George Marshall", "Frank Jack Fletcher", "Conrad Helfrich", "Albert Kesselring"]

In [52]:
sorted(commander_names, key=lambda x: x.split(" ")) # [-1] gives the last names

['Alan Brooke',
 'Albert Kesselring',
 'Conrad Helfrich',
 'Frank Jack Fletcher',
 'George Marshall']

In [13]:
sorted(commander_names, key=lambda x: len(x))

['Alan Brooke',
 'George Marshall',
 'Conrad Helfrich',
 'Albert Kesselring',
 'Frank Jack Fletcher']

In [14]:
# Create a values as dictionary of lists
raw_data = {'0': ['first_name', 'Molly', 'Tina', 'Jake', 'Amy'],
        '1': ['last_name', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        '2': ['age', 52, 36, 24, 73],
        '3': ['preTestScore', 24, 31, 2, 3]}

# Create a dataframe
df = pd.DataFrame(raw_data)

# View a dataframe
df

            0          1    2             3
0  first_name  last_name  age  preTestScore
1       Molly   Jacobson   52            24
2        Tina        Ali   36            31
3        Jake     Milner   24             2
4         Amy      Cooze   73             3

In [15]:
header = df.iloc[0]

In [16]:
df = df[1:]
df.rename(columns = header)

  first_name last_name age preTestScore
1      Molly  Jacobson  52           24
2       Tina       Ali  36           31
3       Jake    Milner  24            2
4        Amy     Cooze  73            3

In [17]:
# Create a list of three strings.
incoming_reports = ["We are attacking on their left flank but are losing many men.",
               "We cannot see the enemy army. Nothing else to report.",
               "We are ready to attack but are waiting for your orders."]

In [18]:
# # import word tokenizer
# from nltk.tokenize import word_tokenize

# # Apply word_tokenize to each element of the list called incoming_reports
# tokenized_reports = [word_tokenize(report) for report in incoming_reports]

# # View tokenized_reports
# tokenized_reports

In [19]:
# # Import regex
# import re

# # Import string
# import string


# regex = re.compile('[%s]' % re.escape(string.punctuation)) #see documentation here: http://docs.python.org/2/library/string.html

# tokenized_reports_no_punctuation = []

# for review in tokenized_reports:

#     new_review = []
#     for token in review:
#         new_token = regex.sub(u'', token)
#         if not new_token == u'':
#             new_review.append(new_token)

#     tokenized_reports_no_punctuation.append(new_review)

# tokenized_reports_no_punctuation

In [20]:
# from nltk.corpus import stopwords

# tokenized_reports_no_stopwords = []
# for report in tokenized_reports_no_punctuation:
#     new_term_vector = []
#     for word in report:
#         if not word in stopwords.words('english'):
#             new_term_vector.append(word)
#     tokenized_reports_no_stopwords.append(new_term_vector)

# tokenized_reports_no_stopwords

In [21]:
raw_data = {'patient': [1, 1, 1, 2, 2],
        'obs': [1, 2, 3, 1, 2],
        'treatment': [0, 1, 0, 1, 0],
        'score': ['strong', 'weak', 'normal', 'weak', 'strong']}
df = pd.DataFrame(raw_data, columns = ['patient', 'obs', 'treatment', 'score'])
df

   patient  obs  treatment   score
0        1    1          0  strong
1        1    2          1    weak
2        1    3          0  normal
3        2    1          1    weak
4        2    2          0  strong

In [22]:
def score_to_numeric(x):
    if x=='strong':
        return 3
    if x=='normal':
        return 2
    if x=='weak':
        return 1

In [23]:
df["score_num"] = df["score"].apply(score_to_numeric)

In [24]:
df

   patient  obs  treatment   score  score_num
0        1    1          0  strong          3
1        1    2          1    weak          1
2        1    3          0  normal          2
3        2    1          1    weak          1
4        2    2          0  strong          3

In [25]:
df.drop("score",1)

   patient  obs  treatment  score_num
0        1    1          0          3
1        1    2          1          1
2        1    3          0          2
3        2    1          1          1
4        2    2          0          3

In [26]:
list_of_lists = [['Amy','Betty','Cathryn','Dana'],
                 ['Elizabeth','Fay','Gora'],
                  ['Heidi','Jane','Kayley']]

In [27]:
flattened_list = [i for row in list_of_lists for i in row]

In [28]:
flattened_list

['Amy',
 'Betty',
 'Cathryn',
 'Dana',
 'Elizabeth',
 'Fay',
 'Gora',
 'Heidi',
 'Jane',
 'Kayley']

In [29]:
data = {'Platoon': ['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C'],
       'Casualties': [1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6]}
df = pd.DataFrame(data)
df

    Casualties Platoon
0            1       A
1            4       A
2            5       A
3            7       A
4            5       A
5            5       A
6            6       B
7            1       B
8            4       B
9            5       B
10           6       B
11           7       C
12           4       C
13           6       C
14           4       C
15           6       C

In [30]:
# Rolling Mean
df.groupby("Platoon")["Casualties"].apply(lambda x:x.rolling(center=False,window=2).mean())

0     NaN
1     2.5
2     4.5
3     6.0
4     6.0
5     5.0
6     NaN
7     3.5
8     2.5
9     4.5
10    5.5
11    NaN
12    5.5
13    5.0
14    5.0
15    5.0
Name: Casualties, dtype: float64

In [31]:
# Applying Operations Over pandas Dataframes
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

In [32]:
capitalizer = lambda x: x.upper()

In [33]:
df['name'].apply(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
Name: name, dtype: object

In [34]:
df['name'].map(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
Name: name, dtype: object

In [35]:
df = df.drop('name', axis=1)

In [36]:
df.applymap(np.sqrt)

            coverage   reports       year
Cochice     5.000000  2.000000  44.855323
Pima        9.695360  4.898979  44.855323
Santa Cruz  7.549834  5.567764  44.866469
Maricopa    7.874008  1.414214  44.877611
Yuma        8.366600  1.732051  44.877611

In [37]:
# create a function called times100
def times100(x):
    # that, if x is a string,
    if type(x) is str:
        # just returns it untouched
        return x
    # but, if not, return it multiplied by 100
    elif x:
        return 100 * x
    # and leave everything else
    else:
        return

In [38]:
df.applymap(times100)

            coverage  reports    year
Cochice         2500      400  201200
Pima            9400     2400  201200
Santa Cruz      5700     3100  201300
Maricopa        6200      200  201400
Yuma            7000      300  201400

In [39]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [40]:
groupby_regiment = df['preTestScore'].groupby(df['company'])
groupby_regiment

In [41]:
list(df['preTestScore'].groupby(df['company']))

[('1st', 0     4
  1    24
  4     3
  5     4
  8     2
  9     3
  Name: preTestScore, dtype: int64), ('2nd', 2     31
  3      2
  6     24
  7     31
  10     2
  11     3
  Name: preTestScore, dtype: int64)]

In [42]:
df['preTestScore'].groupby([df['regiment'], df['company']]).mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [43]:
df['preTestScore'].groupby([df['regiment'], df['company']]).mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [44]:
df.groupby(['regiment', 'company']).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

In [45]:
df.groupby(['regiment', 'company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [46]:
df.groupby('regiment').mean().add_prefix('mean_')

            mean_preTestScore  mean_postTestScore
regiment
Dragoons                15.50                61.5
Nighthawks              15.25                59.5
Scouts                   2.50                66.0

In [47]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'sex': ['male', 'female', 'male', 'female', 'female']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'sex'])
df

  first_name last_name     sex
0      Jason    Miller    male
1      Molly  Jacobson  female
2       Tina       Ali    male
3       Jake    Milner  female
4        Amy     Cooze  female

In [48]:
df_sex = pd.get_dummies(df['sex'])

In [49]:
df_sex

   female  male
0       0     1
1       1     0
2       0     1
3       1     0
4       1     0

In [50]:
df_new = pd.concat([df, df_sex], axis=1)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male       0     1
1      Molly  Jacobson  female       1     0
2       Tina       Ali    male       0     1
3       Jake    Milner  female       1     0
4        Amy     Cooze  female       1     0

In [51]:
df_new = df_new.drop(df["sex"],1)

In [53]:
raw_data = {'date': ['2014-06-01T01:21:38.004053', '2014-06-02T01:21:38.004053', '2014-06-03T01:21:38.004053'],
        'score': [25, 94, 57]}
df = pd.DataFrame(raw_data, columns = ['date', 'score'])
df

                         date  score
0  2014-06-01T01:21:38.004053     25
1  2014-06-02T01:21:38.004053     94
2  2014-06-03T01:21:38.004053     57

In [54]:
df["date"] = pd.to_datetime(df["date"])

In [56]:
df = df.set_index(df["date"])

In [60]:
df

                                                 date  score
date
2014-06-01 01:21:38.004053 2014-06-01 01:21:38.004053     25
2014-06-02 01:21:38.004053 2014-06-02 01:21:38.004053     94
2014-06-03 01:21:38.004053 2014-06-03 01:21:38.004053     57

In [62]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'age': [42, 52, 36, 24, 73],
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, columns = ['name', 'age', 'preTestScore', 'postTestScore'])
df

    name  age  preTestScore  postTestScore
0  Jason   42             4             25
1  Molly   52            24             94
2   Tina   36            31             57
3   Jake   24             2             62
4    Amy   73             3             70

In [63]:
df['elderly'] = np.where(df['age']>=50, 'yes', 'no')

In [64]:
df

    name  age  preTestScore  postTestScore elderly
0  Jason   42             4             25      no
1  Molly   52            24             94     yes
2   Tina   36            31             57      no
3   Jake   24             2             62      no
4    Amy   73             3             70     yes

In [ ]:

title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
train['Title'] = train['Title'].map(title_mapping)
train['Title'] = train['Title'].fillna(0)